- More optimized for handling different types of large data sets


- Built-upon numpy


- multiple datatypes in the same dataset, wee need a tool which can handle multi-dimensional data

## Professor, professional vids valay k liye, deep learning and machine learning aik hi cheez hay!!!
### Vo 2non words interchangeably use kray ga

### 'Python for Data Analysis - 2nd ed'

- ye kitaab zrooooOr parhni hay, sath sath

## Series in Pandas

<img src="Series-1.png" width=400 height=400 />

### Creating Series Using List

In [38]:
import pandas as pd

obj = pd.Series([4, 7,-5, 3]) # note! [S]eries ka [S] capital hay!

print(obj)

0    4
1    7
2   -5
3    3
dtype: int64

#### Pandas Series has two things in one object
- Values
- Indices / Labels

In [39]:
sales = pd.Series([100, 200, 100, 400])

print(sales.values)

# ab sirf values hi print huieen

[100 200 100 400]

In [8]:
print(sales.index)
# values k ilava is k andar indices bhi mojood hain, jo start 0 say ho rahay hain
# or end 4 par ho rahay hain, in steps of 1

RangeIndex(start=0, stop=4, step=1)

In [1]:
# integers hum apni mrzi say non-numeric bhi rakh sktay hain. E.g:
import pandas as pd

sales = pd.Series([100, 200, 100, 400], index = ['Jan', 'Feb', 'March', 'April'])

sales.index.name = 'Months'



print(sales)

Months
Jan      100
Feb      200
March    100
April    400
dtype: int64

#### Jan, Feb etc ko labels bhi kehtay hain

In [9]:
print(sales.index)

# note! dtype = object, agar panda ko koi data type complex lagta hay, osay lgta hay
# k ye int nahi hay, tu vo osay aik complex dtype ka naam day deta hay, jisay hum
# object kehtay hain. is k andar har qism ka data hum store kr sktay hain

Index(['Jan', 'Feb', 'March', 'April'], dtype='object', name='Months')

In [43]:
# kisi or series k indices kray huye ye new series bnai
s2 = pd.Series([100, 200, 100, 400], index = sales.index)

s2

# khayal krna #-of-indices same hoon

Months
Jan      100
Feb      200
March    100
April    400
dtype: int64

In [46]:
# broadcasting via indices
s2 = pd.Series(100, index = sales.index)

s2

# hum nay sirf 100 dia tha, or indices kisi pr series say uthaye os nay tmaam indices k against
# 100 ko broadcast kr dia

Months
Jan      100
Feb      100
March    100
April    100
dtype: int64

In [4]:
# import pandas as pd
# s2 = pd.Series(100, index = sales.index)

In [7]:
sales = pd.Series([100, 200, 100, 400], index = ['Jan', 'Feb', 78, 'April'])
print(sales.index)
print('\n')
print(sales)

# each index e.g. Jan, feb etc, is also called a label

Index(['Jan', 'Feb', 78, 'April'], dtype='object')


Jan      100
Feb      200
78       100
April    400
dtype: int64

#### dtype: int64  for values
#### dtype: 'object' for indices

#### Note: default index (0,1,2,3,..) bhi apni jaga mojood hain on k zariye bhi values access kr sktay hain

In [25]:
sales = pd.Series([100, 200, 100, 400], index = ['Jan', 'Feb', 78, 'April'], name = '4 month sales')
print(sales)
# 'name' ko later column header k toor pr use krain gay, we'll see it later
# I don't think k ye column header k toor pr use hua hay Data Frame main, 'name = [...]' jab DataFrame main as argument pas kro
# tu error aata hay.
# Han albatta columns k names rakh sktay hain DataFrame main, laikin os k liye d/f command use hti hay, see the DataFrame
# section for more details

Jan      100
Feb      200
78       100
April    400
Name: 4 month sales, dtype: int64

#### task: aik canteen sandwiches baichti hay, aap nay btana hay k aik haftay main os nay har rooz kitnay sandwiches baichay hain

In [12]:
sw = pd.Series([20, 30, 20, 25, 30, 40, 0], 
                          index = ['mon', 'tue', 'wed', 'thur', 'fri', 'sat', 'sun'], 
                          name = 'sandwich-sales')

sw.index.name = 'DAY'

print(sw)

DAY
mon     20
tue     30
wed     20
thur    25
fri     30
sat     40
sun      0
Name: sandwich-sales, dtype: int64

### accessing elements

In [39]:
#old way - numpy-style
print(sw[0], '\n')

#new-way - pandas-way
print(sw['sat'], '\n')  # jab data ziada ho tu, yei index vala kaam aasaan reh jata hay

# so, we can use both ways!

20

40

In [48]:
# accessing multiple values

print(sw[ [3,5] ]) 
# note multiple square brackets
# one for sw
# one for giving multiple values
# so, we have to use array notation

thur    25
sat     40
Name: sandwich-sales, dtype: int64

In [49]:
# can also use index
print(sw[ ['mon','sun'] ])

mon    20
sun     0
Name: sandwich-sales, dtype: int64

### conditional selection

#### for providing multiple index for selecting element in a pd series, use array notation

In [56]:
# sw ki vo sari values jo 20 say bari hain
print(sw [ sw>20 ] )
# fucking amazing! ye on k index bhi bta rha hay k sales flaan flaan din 20 say opar
# rahi hay

tue     30
thur    25
fri     30
sat     40
Name: sandwich-sales, dtype: int64

#### Arithematic Operations on Series

In [8]:
s1 = pd.Series([1, 2, 3, 4, 5, 6, 7], 
                          index = ['mon', 'tue', 'wed', 'thur', 'fri', 'sat', 'sun'], 
                          )

s2 = pd.Series([1, 2, 3, 4, 5, 6, 7], 
                          index = ['sun', 'tue', 'wed', 'thur', 'fri', 'sat','mon'], 
                          )

print(s1 + s2)

# live recording 21 Jan, 2023, Nasir - 26:00. Note: resulting series ki sequence sir k logic vli nahi hay

fri     10
mon      8
sat     12
sun      8
thur     8
tue      4
wed      6
dtype: int64

In [9]:
s1 = pd.Series([1, 2, 3, 4, 5, 6, 7])

s2 = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])

print(s1 + s2)

# live recording 21 Jan, 2023, Nasir - 26:00. Note: resulting series ki sequence sir k logic vli nahi hay

0     2.0
1     4.0
2     6.0
3     8.0
4    10.0
5    12.0
6    14.0
7     NaN
8     NaN
9     NaN
dtype: float64

### Numpy ki arrays main aesa krtay tu, jb tk shapes same na hoteen tb tak kaam nahi hna tha.
yahan:
- Realignment bhi automatically ho jati hay
- Different shapes ki series bhi add ho jti hain

In [57]:
sw*2

mon     40
tue     60
wed     40
thur    50
fri     60
sat     80
sun      0
Name: sandwich-sales, dtype: int64

In [59]:
print(sw)
# so, 'sw' bazat-e-khud change nahi hua

mon     20
tue     30
wed     20
thur    25
fri     30
sat     40
sun      0
Name: sandwich-sales, dtype: int64

In [61]:
sw = sw*2
sw

mon      80
tue     120
wed      80
thur    100
fri     120
sat     160
sun       0
Name: sandwich-sales, dtype: int64

In [63]:
sw = sw/2
sw

# note, values hain tu vahi puranay valay hi, but ab dtype float ho gaya hay, ab
# dtype = int nahi hay!

mon     20.0
tue     30.0
wed     20.0
thur    25.0
fri     30.0
sat     40.0
sun      0.0
Name: sandwich-sales, dtype: float64

#### checking whether a row/index exists in our series or not!

In [67]:
'mon' in sw

True

#### creating pandas series from numpy data/arrays

In [2]:
import numpy as np
import pandas as pd

ar  = np.array([3,2,'a',5,6])
ind = np.array(['a', 'b', 'c', 'd', 'e'])

obj2 = pd.Series(ar, index = ind)


print(obj2)

a    3
b    2
c    a
d    5
e    6
dtype: object

In [3]:
ar[1:4]

array(['2', 'a', '5'], dtype='<U11')

### Slicing

#### numpy way

In [4]:
sw = pd.Series([20, 30, 20, 25, 30, 40, 0], 
                          index = ['mon', 'tue', 'wed', 'thur', 'fri', 'sat', 'sun'], 
                          name = 'sandwich-sales')
sw[1:4]

# Note the range is [a : b)

tue     30
wed     20
thur    25
Name: sandwich-sales, dtype: int64

#### new way

In [5]:
sw['tue':'fri']

# Note the range is [a : b]

tue     30
wed     20
thur    25
fri     30
Name: sandwich-sales, dtype: int64

In [6]:
# updating values


sw['mon':'sat':2] = [1,2,3]
sw

mon      1
tue     30
wed      2
thur    25
fri      3
sat     40
sun      0
Name: sandwich-sales, dtype: int64

In [80]:
sdata = {"Sindh": 35000,
        'Punjab': 4500,
        'KPK': 3000,
        'Balochistan': 2000}

tax_by_state = pd.Series(sdata)
print(tax_by_state)

# vao! ye tu simply directly dictionary pass krnay say hi kaam ho gaya

Sindh          35000
Punjab          4500
KPK             3000
Balochistan     2000
dtype: int64

#### changing order of rows/indices

In [7]:
sdata = {"Sindh": 35000,
        'Punjab': 45000,
        'KPK': 30000,
        'Balochistan': 20000}

tax_by_state = pd.Series(sdata, index = ['Punjab',"Sindh",'KPK','Balochistan'])

# note! indices k andar hum nay punjab or sindh ki positions exchange kr deen,
# panda nay new positions hi store keen,

# note values ki positions bhi os nay indices k sath hi displace kr deen!!!

print(tax_by_state)

Punjab         45000
Sindh          35000
KPK            30000
Balochistan    20000
dtype: int64

**Sources for series data**
- direct data in the series method
- from numpy array/arrays
- from list
- from dictionary

#### identifying null/missing values in the data. Null zero k brabar nahi hta. ye simply absence of a value hay. the value simply does not exists.

In [9]:
tax_by_state = pd.Series(sdata, index = ['Punjab',"Sindh",'KPK','Balochistan',
                                         'GB'])
print(tax_by_state)
# Note 'Nan' in the value against GB

Punjab         45000.0
Sindh          35000.0
KPK            30000.0
Balochistan    20000.0
GB                 NaN
dtype: float64

In [89]:
# ye aik function hay

print( pd.isnull( tax_by_state ) )
# ye dikha raha hay k knsay index par aik null value pri hui hay

Punjab         False
Sindh          False
KPK            False
Balochistan    False
GB              True
dtype: bool

In [91]:
# ye aik method hay
tax_by_state.isnull()

Punjab         False
Sindh          False
KPK            False
Balochistan    False
GB              True
dtype: bool

#### Name for Values Vs Name for indices

In [95]:
# name for values, I am not sure k ye name values k liye hi hay ya phir, series ka naam hay ye, see book, maybe
# u can find details there

tax_by_state.name = 'State tax paying capacity'

# name for indices
tax_by_state.index.name = 'States Name'

print(tax_by_state)
print('\n\n\n')
print(tax_by_state.index)

States Name
Punjab         45000.0
Sindh          35000.0
KPK            30000.0
Balochistan    20000.0
GB                 NaN
Name: State tax paying capacity, dtype: float64




Index(['Punjab', 'Sindh', 'KPK', 'Balochistan', 'GB'], dtype='object', name='States Name')

### changing names of indices in a series

In [102]:
sw

mon     20
tue     30
wed     20
thur    25
fri     30
sat     40
sun      0
Name: sandwich-sales, dtype: int64

In [17]:
sw.index = ['m', 't', 'w', 't', 'f', 's', 's']
print(sw)
# is trah say names sirf change hi htay hain, agar interchange krnay hoon tu pichlay vala tareeka use krna pray ga.

m    20
t    30
w    20
t    25
f    30
s    40
s     0
Name: sandwich-sales, dtype: int64

In [62]:
s6 = pd.Series( np.linspace(1, 10, 19) )

s6
# linspace = linear spacing

0      1.0
1      1.5
2      2.0
3      2.5
4      3.0
5      3.5
6      4.0
7      4.5
8      5.0
9      5.5
10     6.0
11     6.5
12     7.0
13     7.5
14     8.0
15     8.5
16     9.0
17     9.5
18    10.0
dtype: float64

In [64]:
s6.count()

19

In [67]:
s6.value_counts()
# bht important function hay, ye bta rha hay k, kn kn si value kitni baar aai hay

1.0     1
6.0     1
9.5     1
9.0     1
8.5     1
8.0     1
7.5     1
7.0     1
6.5     1
5.5     1
1.5     1
5.0     1
4.5     1
4.0     1
3.5     1
3.0     1
2.5     1
2.0     1
10.0    1
dtype: int64

In [11]:
new = pd.Series([99, 100, 89, 50, 45, 30], index = ['Ahmed', 'Ali', 'Faisal', 'Hassan', 'Aqsa', 'Waji'])

new = new.apply(lambda x: np.where(x>50, 'Pass', 'Fail'))

new.value_counts()

# vow!

# we can use to check, male kitnay hain, female kitni hain
# meray column k andar jitni categories hoon gi, on categories ka count btao
#

Pass    3
Fail    3
Name: count, dtype: int64

In [73]:
new.head()

new.tail()

# .tail() aakhri ki 5 values show krti hay

Ali       Pass
Faisal    Pass
Hassan    Fail
Aqsa      Fail
Waji      Fail
dtype: object

In [75]:
new[ ['Ahmed', 'Ali'] ]

# Aik say ziada labels ka data get krnay lgay hain

Ahmed    Pass
Ali      Pass
dtype: object

In [76]:
# loc iloc bhi series main kr sktay hian,
# but isay aagay data frame main daikhain gay

In [77]:
# series main Nan value dalni ho kaheen tu kesay krna hay?

s7 = pd.Series( [1, 2, 3, np.nan, np.nan] )
s7

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
dtype: float64

In [ ]:
# Sir ki book: Learning pandas by Michael Heydt vli book bhi pri hui hay, sir Nasir
# k data valay folder main

# Boolean selection daikh lena >, <, less than greater than etc, ye daikh lena book say
# most probably main nay numpy ki book main 9s par kaam kia hoga

In [12]:
# concat copies index values verbatim,
# potentially making duplicates

import numpy  as np
import pandas as pd

np.random.seed(123456)  # series random numbers ko fix kr day ga, jitni bar bhi chalayin gya same ahi answer aye ga

s1 = pd.Series( np.random.randn(3) )
s2 = pd.Series( np.random.randn(3) )

print(s1)
print()
print(s2)

0    0.469112
1   -0.282863
2   -1.509059
dtype: float64

0   -1.135632
1    1.212112
2   -0.173215
dtype: float64

In [18]:
combined = pd.concat(  [s1, s2]  )
combined
 # ye add ni hua hay, ye CONCATENATE hua hay

0    0.469112
1   -0.282863
2   -1.509059
0   -1.135632
1    1.212112
2   -0.173215
dtype: float64

In [88]:
combined[0]
# lolz 2 zero hain is concatenated series main

0    0.469112
0   -1.135632
dtype: float64

In [89]:
# To fix this, the following creates a new index for the concatenated result which has 
# sequential and distinct values.

# reset the index

combined.index = np.arange(0, len(combined))
combined

0    0.469112
1   -0.282863
2   -1.509059
3   -1.135632
4    1.212112
5   -0.173215
dtype: float64

In [93]:
# you can also use
# create the series again, before running this cell

combined.reindex( [0, 1, 2, 3, 4, 5, 6] )

0    0.469112
1   -0.282863
2   -1.509059
3   -1.135632
4    1.212112
5   -0.173215
6         NaN
dtype: float64

In [97]:
# you can also use
# create the series again, before running this cell

combined.reset_index()

   index         0
0      0  0.469112
1      1 -0.282863
2      2 -1.509059
3      0 -1.135632
4      1  1.212112
5      2 -0.173215

In [19]:
combined.reset_index(  drop = True, inplace = True ) # inplace = True: ab 'combined' bazat e khud update bhi ho jaye gi
# ab 2ble indices vli problem khtmm
combined

0    0.469112
1   -0.282863
2   -1.509059
3   -1.135632
4    1.212112
5   -0.173215
dtype: float64

In [20]:
combined[4] = 2345

combined

0       0.469112
1      -0.282863
2      -1.509059
3      -1.135632
4    2345.000000
5      -0.173215
dtype: float64

In [21]:
# error expected
# is trah say del ni kr sktay


del combined[1:4]

combined

InvalidIndexError: slice(1, 4, None)

In [24]:
# again error expected, ye slices delete ni krta na lists ki form main, is trah say one by one hi kaam krna pray ga aap ko

del combined[ [1,3,4] ]

combined

InvalidIndexError: [1, 3, 4]

In [25]:
print(combined)

del combined[4]

combined

#Note frame k andar hum slices bhi del kr sktay hain, but series k andar sirf aik-aik kr k hi cheezain del hoon gi, jesay is cel main kia hay main nay

0       0.469112
1      -0.282863
2      -1.509059
3      -1.135632
4    2345.000000
5      -0.173215
dtype: float64

0    0.469112
1   -0.282863
2   -1.509059
3   -1.135632
5   -0.173215
dtype: float64

In [27]:
# replace kr sktay hain slices! but del ni kr sktay e.g:

combined[0:5] = 100

combined

# note 4th index mojood ni tha, phir bhi error ni aaya

0    100.0
1    100.0
2    100.0
3    100.0
5    100.0
dtype: float64

In [29]:
newCom  = combined.copy()

newCom

# ye vli copy, jesa k hum nay python main bhi parha tha, yahan by-value copy hoga, by-reference copy ni hoga
# by-reference: oldCom = newCom

0    100.0
1    100.0
2    100.0
3    100.0
5    100.0
dtype: float64

In [38]:
oldCom = newCom

oldCom

0    100.0
1    100.0
2    100.0
3    100.0
5    100.0
dtype: float64

In [39]:
newCom[:] = 200

newCom

0    200.0
1    200.0
2    200.0
3    200.0
5    200.0
dtype: float64

In [40]:
oldCom

0    200.0
1    200.0
2    200.0
3    200.0
5    200.0
dtype: float64

In [36]:
# copy by-reference

In [30]:
a = [1,2,3,4,5]

In [31]:
b = a

In [32]:
b

[1, 2, 3, 4, 5]

In [33]:
a = [5,4,3,2,1]

In [34]:
a

[5, 4, 3, 2, 1]

In [35]:
b

[1, 2, 3, 4, 5]

In [41]:
# prof k logic k mutabiq, q k 'b' by-reference create hua tha, so, 'a' k change hnay say 'b' bhi chnage hoga, but aesa yahan nahi hua
# maybe jab jupyter notebook par code run ni krain gay, jab , kaheen or code run hoga, tu aesa hi hoga? jesay sir nay kaha hay

# ye cheez list k liye kaam ni krti but, series k case main professor ka logic kaam krta hay!!!

# Data Frame

#### pehlay aik column tha, ab multiple columns hoon gay. multiple column ko hum naam bhi day sktay hain. index-of-column, bhi mojood hoga. index-of-column numeric bhi ho skta hay, non-numeric bhi ho skta hay.

- column ko access krna hua tu naam-name/index(0,1,2,..)  2non k zariye say access kr sktay hain
- row ko access krna hua tu naam-label/index(0,1,2,..)  2non k zariye say access kr sktay hain

#### Examples:

<img src="DataFrame1.png" width=400 height=400 />

<img src="DataFrame2.png" width=400 height=400 />

### merging series to make a data frame

#### jab 2 say 2 say ziada series ko aap merge kr rahay hotay ho tb, indices same hni chahiyeain, agar same na huieen tu data merge nahi hoga.

<img src="series-merge.png" width=400 height=400 />

#### Creating a DataFrame from Dictionary of Series

In [1]:
import pandas as pd

# creating two series
apples  = pd.Series( [3,2,0,1,4,9,6], index = ['mon', 'tue', 'wed', 'thu', 'fri', 'sat', 'sun'] )
oranges = pd.Series( [3,2,0,1,4,9,6], index = ['mon', 'tue', 'wed', 'thu', 'fri', 'sat', 'sun'] )


# printing two series separately
print(apples, '\n\n')
print(oranges)


# creating a dictionary
# dictionary say directly series bhi bana sktay hain
# dictionary say directly Data Frame bhi bana sktay hain

data = {'Apples': apples,
       'Oranges': oranges}
# 'Apples', 'Oranges ye hamaray columns k naam hoon gay'



# creating a DataFrame
fruits_df = pd.DataFrame(data)

print('\n\n', fruits_df)

mon    3
tue    2
wed    0
thu    1
fri    4
sat    9
sun    6
dtype: int64


mon    3
tue    2
wed    0
thu    1
fri    4
sat    9
sun    6
dtype: int64


      Apples  Oranges
mon       3        3
tue       2        2
wed       0        0
thu       1        1
fri       4        4
sat       9        9
sun       6        6

#### Merging series with d/f indices

#### jo jo indices d/f hoon gay, vo 2non hi newly-created dat-frame main aa jayain gay, BUTTT oppposite-series valay column mn on ki values Nan hhon gi, E.G: see 'm' vs 'mon' in the following series

In [2]:
import pandas as pd

# creating two series
apples  = pd.Series( [3,2,0,1,4,9,6], index = ['m', 'tue', 'wed', 'thu', 'fri', 'sat', 'sun'] )
oranges = pd.Series( [3,2,0,1,4,9,6], index = ['mon', 'tue', 'wed', 'thu', 'fri', 'sat', 'sun'] )


# printing two series separately
print(apples, '\n\n')
print(oranges)


# creating a dictionary
# dictionary say directly series bhi bana sktay hain
# dictionary say directly Data Frame bhi bana sktay hain

data = {'Apples': apples,
       'Oranges': oranges}
# 'Apples', 'Oranges ye hamaray columns k naam hoon gay'



# creating a DataFrame
fruits_df = pd.DataFrame(data)

print('\n\n', fruits_df)

m      3
tue    2
wed    0
thu    1
fri    4
sat    9
sun    6
dtype: int64


mon    3
tue    2
wed    0
thu    1
fri    4
sat    9
sun    6
dtype: int64


      Apples  Oranges
fri     4.0      4.0
m       3.0      NaN
mon     NaN      3.0
sat     9.0      9.0
sun     6.0      6.0
thu     1.0      1.0
tue     2.0      2.0
wed     0.0      0.0

In [3]:
# note previously hum pd.Series() ko "Dictionary of key-value pairs" send krtay thay, or hamain, aik series output milti thi
# jis ki indices dict-keys hti theen or jis ki values dict-value hti theen

# Ab hum pd.DataFrame() ko "Dictionary-of-Series" pass kr rahay hain, or dict-keys ko as column-names lay rha hay, or
# Dict-Values ko as column-values lay rha hain + index names bhi onhi series say lay rha hain.

fruits_df.index.name = 'indices'

print(fruits_df)x
# vao is nay index k naam ko vaziha toor pr columns k naamon say d/f kr k likha hay

         Apples  Oranges
indices
mon           3        3
tue           2        2
wed           0        0
thu           1        1
fri           4        4
sat           9        9
sun           6        6

#### Creating a DataFrame from Dictionary of Lists

In [4]:
state = ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']

data = {'state': state,
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}


frame = pd.DataFrame(data)
print(frame)
# ab indices automatically aaye
# is bar Dictionary-of-series hum nay pass NAHI ki thi, still, dict-keys ko os nay as column names hi use kia

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

#### Passing indices directly inside DataFrame()

In [1]:
import pandas as pd

# chahay tu index day do koi, chahay tu na do
state = ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']

data = {'state': state,
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}


frame = pd.DataFrame(data, index = ['1st', '2nd', '2rd', '4th', '5th', '6th'])
print(frame)

      state  year  pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
2rd    Ohio  2002  3.6
4th  Nevada  2001  2.4
5th  Nevada  2002  2.9
6th  Nevada  2003  3.2

In [5]:
# error expected
# #-of index thoray pass kiye thay
# ziada pass krnay say bhi error aaye ga




frame = pd.DataFrame(data, index = ['1st', '2nd', '2rd', '4th', '5th'])
print(frame)

ValueError: Length of values (6) does not match length of index (5)

#### can write data-frame on multiple lines

In [28]:
state_pop_df = pd.DataFrame(data, index = ['1st', '2nd',
                                    '3rd', '4th',
                                    '5th', '6th'])
print(state_pop_df)

# commas, brackets etc ka khayal rakhna

      state  year  pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
2rd    Ohio  2002  3.6
4th  Nevada  2001  2.4
5th  Nevada  2002  2.9
6th  Nevada  2003  3.2

### ------.head()
#### agar data-set bohot bara ho tu isay use kr sktay hain, ye top 5 ko hi bas print kray ga

Some good practices:
- Jab bhi koi data-frame aap banao, tu os k naam k aakhir main   **_df** zroor lgao, isay aap ko yaad rahay ga k ye aik data-frame-object hay


- data-frame object ka naam hmaisha, os k andar jo data hoga, os data k characteristics say mutabqat rkhta ho. e.g agar state ki population ka data hay, tu data-frame object ka naam **state_pop_df** rakh lo


- jab baray baray programs bnao gay, tab koshish kro k har variable ka naam, bara or meaningful ho, tb aap ko kaam main aasaani hogi.

In [29]:
state_pop_df.head()

      state  year  pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
2rd    Ohio  2002  3.6
4th  Nevada  2001  2.4
5th  Nevada  2002  2.9

### changing the positions/arrangement of columns

Jis trah Series k case main, hum indices ki positions change kr detay thay.
Original data set vli positions use nahi krtay thay, apni mrzi ki positions use krtay thay.
Or ye kaam, Series create krtay vaqt hi ho skta tha (most-probably)


Osi trah, voi kaam, Data frame main, columns k sath bhi kr sktay hain.

In [6]:
# chahay tu index day do koi, chahay tu na do
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}


state_popu_df = pd.DataFrame(data, columns = ['year', 'state', 'pop'])
state_popu_df.head()

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

Agar kisi column ka naam d/f pass kr diya - d/f as-compared-to original data-set, tu os column ki tamaam values main **'Nan'** aa jaye ga

Asal main, pandas ab isay aik new column ki trah treat kr raha hay, see 2nd cell

In [34]:
# 'Nan' expected
state_popu_df = pd.DataFrame(data, columns = ['year', 'state', 'popu'])
state_popu_df.head()

   year   state popu
0  2000    Ohio  NaN
1  2001    Ohio  NaN
2  2002    Ohio  NaN
3  2001  Nevada  NaN
4  2002  Nevada  NaN

### Inserting an extra column by mistake

we can fill this extra column later

In [36]:
# 'Nan' expected
state_popu_df = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'])
state_popu_df.head()

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN

### Passing both labels/indices AND columns/names

In [11]:
state_popu_df = pd.DataFrame(data, columns = ['year', 'state', 'pop'],
                             index = ['one', 'two', 'three', 'four',
                                      'five', 'six'])

state_popu_df.head()

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9

### Printing columns of a Data-Frame

In [46]:
print(state_popu_df.columns, '\n\n')
print(state_popu_df.index)  # ye rows/labels k naam hain

# Output main, 2non lines k shuru main 'index' likha hua hay, laikin hum nay
# Pehli line main columns maangay thay, or 2sri line main indices/labels maangay thay

# agar aesay likho gay tu confusion ni hogi print('Columns', state_popu_df.columns)
# and so on...

Index(['year', 'state', 'pop'], dtype='object')


Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

# Accessing data in Data Frame

## A column in a DataFrame can be retrieved as a Series either by dict-like notation or by attribute

Jab dictionary-like notation main retrieve kro gay, tu os k bad, os k elements ko dictionary ki trah treat kr sktay hain, dictionary ki trah access kr sktay hain.

#### Dictionary-Like Notation

In [47]:
# E.g:

state_popu_df['year'] 
# this is the dictionary-like notation

# ye ab as aik series

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

### Attribute Style

#### Extracting Columns - Attribute Style

In [48]:
state_popu_df.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

#### Extracting Rows/labels - Attribute Style

In [14]:
state_popu_df.loc['one']
# ye poray ki pori row, along the names of each columns extract ho gai!

year     2000
state    Ohio
pop       1.5
Name: one, dtype: object

#### extracting multiple rows

In [18]:
state_popu_df.loc[ ['one', 'two'] ]
# ab list of row-names pass ki hay isay

     year state  pop
one  2000  Ohio  1.5
two  2001  Ohio  1.7

## Function Application and Mapping

## Lambda Functions : Anonymous Functions (IIF)

live recording: 21 Jan, 2023 - Nasir - 47:00 ...

In [30]:
new = pd.Series([99, 100, 89, 50, 45, 30], index = ['Ahmed', 'Ali', 'Faisal', 'Hassan', 'Aqsa', 'Waji'])

In [28]:
#### old way

In [26]:
def myfunc(marks): # isay marks dain gay, ye marks ki percentage return kray ga
    return marks/100

In [27]:
new.apply(myfunc)

Ahmed     0.99
Ali       1.00
Faisal    0.89
Hassan    0.50
Aqsa      0.45
Waji      0.30
dtype: float64

In [31]:
#### new way
# hum koi aesa function bna rahay hain, jo hum nay baar baar use nahi krna, tu hum function ko
# define ni krain gay, bal k, jahan hmain function say kaam lena hay, voheen aik unknown function
# bna dain gay, jis ka naam lambda hoga
# E.G:

new.apply(lambda x:x/100 ) # jo jo value x aaye, osay 100 say divide kr do

# ye aesay hi hua hay jesay function ko poori array pass ki ho or os nay array ki har
# va;ue par vo function perform kr dia ho

# Note hum new/100 bhi kr sktay thay but yahan bas baat smjhanay k liye ye kia hay

# Note 'new' bazat e khud update ni hoga

Ahmed     0.99
Ali       1.00
Faisal    0.89
Hassan    0.50
Aqsa      0.45
Waji      0.30
dtype: float64

In [37]:
import numpy as np

new.apply(lambda x: np.where(x>50, 'Pass', 'Fail'))

# see it's damn simple
# note jab logic bra ho, kaam lamba ho tu new function define kr lo, voi behtar hay

# np nay is par kaam kia cuz series numpy par hi bhuilt hoi hui hay?

Ahmed     Pass
Ali       Pass
Faisal    Pass
Hassan    Fail
Aqsa      Fail
Waji      Fail
dtype: object

In [4]:
# ye code snippet baad main use hoga

# ye function ko define krnay k aik different tareeka hay

f = lambda x: x.max() - x.min()

# ye result ko ,'x' k andar store bhi kr day ga

In [6]:
import numpy as np
import pandas as pd

frame = pd.DataFrame(np.random.randn(4,3),   # (4,3) size ka random Matrix
                     columns = list('bde'),  # list('bde') = ['b', 'd', 'e']
                    index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
print(frame)
# vaah boss!

               b         d         e
Utah   -1.266901  0.519005  1.429332
Ohio   -1.357711 -0.403858  1.464044
Texas  -0.316651 -0.313866 -0.508066
Oregon  0.044108  1.924702 -1.732134

In [6]:
print(abs(frame))
# abs() poray k poray matrix par bhi kaam krta hay!

               b         d         e
Utah    1.160060  1.152072  0.252899
Ohio    1.784152  0.860456  1.233537
Texas   0.134173  1.075179  1.086600
Oregon  0.477938  1.462274  0.637470

#### column-'d' ki max value!

In [7]:
frame['d'].max()
# column-'d' ki max value!

1.462273575226708

#### column-'d' ki min value!

In [8]:
frame['d'].min()

-1.15207236017258

In [9]:
frame['d'].max() - frame['d'].min()

# note: aik logical si baat hay k jab kisi baray number main say chota number
# minus kro gay tu answer +ive hi aaye ga.

2.614345935399288

### Applying self-created functions on Columns

#### axis = 0

In [10]:
f  = lambda x: x.max() - x.min()

df = frame.apply(f, axis = 0)  # is line k zariye function 'f' ko apply kia 'frame' k opar
# 'df' aik series hay

print(df, type(df))

# ye har aik aik column ki max value main say min value subtract kr k return kr raha hay

b    1.918325
d    2.614346
e    1.871007
dtype: float64 <class 'pandas.core.series.Series'>

#### old way of doing the same

In [11]:
def f2(x):
    a = x.max() - x.min()
    return a

df = frame.apply(f, axis = 0)

print(df, type(df))

b    1.918325
d    2.614346
e    1.871007
dtype: float64 <class 'pandas.core.series.Series'>

### Applying  self-created/custom-build  functions on Rows

#### axis = 1

In [12]:
df = frame.apply(f, axis = 1)

print(df, type(df))

Utah      2.312132
Ohio      0.923696
Texas     2.161779
Oregon    2.099743
dtype: float64 <class 'pandas.core.series.Series'>

#### some clarity

In [13]:
frame.min()
# ye given DataFrame k har aik aik column ki min-vale return kr raha hay

b   -0.134173
d   -1.152072
e   -0.637470
dtype: float64

In [14]:
print(frame.max(), '\n\n')

# note, ye Dictionary ki trah behave kr rahi hay
frame.max()['e']

b    1.784152
d    1.462274
e    1.233537
dtype: float64

1.2335367726542876

In [7]:
def f3(x):
    minimum = x.min()
    maximum = x.max()
    
    a = pd.DataFrame([maximum, minimum], index = ['min', 'max'])   # voi numpy ki array say milti julti hi,
                                                                   # data ki arrangement ho ri hay
    
    return a

f3(frame)

            b         d         e
min  0.044108  1.924702  1.464044
max -1.357711 -0.403858 -1.732134

#### Prof's way Using Series

In [9]:
def f3(x):
    minimum = x.min()
    maximum = x.max()
    
    a = pd.Series([maximum, minimum], index = ['min', 'max'])
    
    return a

 
print(frame.apply(f3))

type(frame.apply(f3))

            b         d         e
min  0.044108  1.924702  1.464044
max -1.357711 -0.403858 -1.732134

pandas.core.frame.DataFrame

In [51]:
def f3(x):
    minimum = x.min()
    maximum = x.max()
    
    a = pd.Series([maximum, minimum], index = ['min', 'max'])
    
    b = [maximum, minimum]
    
    return a, b

# note professor 'a' ko DataFrame hi keh raha hay


q, w = f3(frame)

print('w[0]: \n', w[0])
print('\n')
      
print('w[1]: \n', w[1])
print('\n')
      
print('q[min]: \n', q['min'])
print('\n')
      
print('q[1]: \n', q[1])
print('\n')

# w & q 2non hi list of dictionaries ki trah behave kr rahi hain
# q list of dicts ki trah behave kr rahi hay
# is ka matlab hay k ye function k andar is method say jo jum nay series bnai thi
# vo series as a list-of-dictionaries behave kr rahi hay

# Note q vs w:
# 'q' ko hum as series bhi treat kr sktay hain, then 'min' & 'max' is k indices
# hoon gay

w[0]:
 b   -0.269753
d    2.450580
e    1.926812
dtype: float64


w[1]:
 b   -1.928800
d   -0.196427
e   -1.170830
dtype: float64


q[min]:
 b   -0.269753
d    2.450580
e    1.926812
dtype: float64


q[1]:
 b   -1.928800
d   -0.196427
e   -1.170830
dtype: float64

## Sorting and Ranking

### Sorting w.r.t row and column names

In [1]:
import numpy as np
import pandas as pd

frame = pd.DataFrame(np.arange(12).reshape((3,4)),
                    index = ['three', 'one', 'two'],
                    columns = ['d', 'a', 'b', 'c'])

print(frame)
print()

       d  a   b   c
three  0  1   2   3
one    4  5   6   7
two    8  9  10  11

### sorting w.r.t column names
#### axis = 1
#### by-default: axis = 0, ascending = True

In [25]:
# .sort_index() tb tab hi use hoga jab columns k naamon ka rows k naamon k hisaab
# say sorting krna chah rahay hoon gay hum

frame.sort_index(axis = 1)

       a   b   c  d
three  1   2   3  0
one    5   6   7  4
two    9  10  11  8

In [26]:
frame.sort_index(axis = 1, ascending = False)

# ascending = False : lower-higher = False : higher-lower = True

       d   c   b  a
three  0   3   2  1
one    4   7   6  5
two    8  11  10  9

### sorting w.r.t  row names
#### axis = 0

In [27]:
frame.sort_index()
# I think ye jis trah, folders w.r.t names automatically sort htay hain windows main, ye osi trah say sort kr rha hay

# sab say pehlay 'o' ata hay, so, 'o' on top
# phir 't' aata hay, so 't' on 2nd -> then 'three' & 'two' main, muqaabla 'h' vs 'w' hay. 'h' t say pehlay aata hay

       d  a   b   c
one    4  5   6   7
three  0  1   2   3
two    8  9  10  11

In [28]:
frame.sort_index(axis = 0, ascending = False)

       d  a   b   c
two    8  9  10  11
three  0  1   2   3
one    4  5   6   7

### Sorting w.r.t values

In [29]:
frame

       d  a   b   c
three  0  1   2   3
one    4  5   6   7
two    8  9  10  11

In [32]:
frame.sort_values(by = 'b', ascending = False)

# . 'b' ki highest 10 thi
# . row-'two' main pri thi
# . row-'two' ,  3sray number par thi
# . row-'two' , pehlay number par aa gai (is vja say d, a, c ki values bhi move huieen)
# . etc etc...

       d  a   b   c
two    8  9  10  11
one    4  5   6   7
three  0  1   2   3

### Ranking

#### Ranking: knsa data pelay aaye ga, knsa data baad main aaye ga etc etc...

In [36]:
frame

       d  a   b   c
three  0  1   2   3
one    4  5   6   7
two    8  9  10  11

In [37]:
frame.rank(ascending = True, method = 'max')

# . ye har aik aik column par jaye ga
# . e.g. pehlay column d par gaya -> data ko sort kia lower-higher -> phir daikha k index-'three' par '0' pra hay -> '0' sab ...
# . say choota hay, so, sab say pehla number isay do -> so isay rank-1 day dia & so on...

         d    a    b    c
three  1.0  1.0  1.0  1.0
one    2.0  2.0  2.0  2.0
two    3.0  3.0  3.0  3.0

In [30]:
# Another Example
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [43]:
frame.rank(ascending = True, method = 'max')

# . ye har aik aik column par jaye ga
# . e.g. pehlay column 'b' par gaya -> data ko sort kia lower-higher -> phir daikha k index-'0' par '4.3' pra hay -> '4.3' ...
# . ka sorted list main 3sra number banta hay, so, isay 3sra numer do-> so isay rank-3 day dia & so on...


# Note:

    
#     See book pg = 155 & 166:
#         . if original data = [7, -5, 7, 4, 2, 0, 4]
#         . Apparently ye data ko sort kray ga   [7, 7, 4, 4, 2, 0, -5]
#                                                [1, 2, 3, 4, 5, 6,  7]
#         . phir jo number aik say ziada baar aaye hoon gay, on numbers ko jo last rank assign hua hoga, ye onhain, output main,
#         . har jagah, vohi rank assign kray ga

     b    a    c
0  3.0  2.0  2.0
1  4.0  4.0  3.0
2  1.0  2.0  4.0
3  2.0  4.0  1.0

In [45]:
frame.rank(ascending = False, method = ' max')

# same kaam hi kr rahi hay bas data ko lower-higher? sort kr k phir rank kr rahi hay

     b    a    c
0  2.0  4.0  3.0
1  1.0  2.0  2.0
2  4.0  4.0  1.0
3  3.0  2.0  4.0

In [48]:
# baaqi or bhi cheezain is say related hain, see professional vids: '30_1 Function Appli...' 4:50.  book pg = 156

## Summarizing and Computing Descriptive Statistics

#### .sum() on values/data

See pg = 158 for lots and lots of other useful functions

In [7]:
import numpy as np
import pandas as pd

df = pd.DataFrame([
                    [1.4, np.nan],    [7.1 , -4.5],
                    [np.nan, np.nan], [0.75, -1.3]],
                    index = ['a', 'b', 'c', 'd'], columns = ['one', 'two'])

print(df)
print()
print('The sum is: \n',df.sum()) # by-default rows sum kray ga

print()
print(df.sum(axis = 'columns'))  # columns sum kray ga

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

The sum is:
 one    9.25
two   -5.80
dtype: float64

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

#### .mean() on values/data

In [10]:
print(df)
print()
print(df.mean()) # by default successive-rows ki, same column vli values ka mean nikalay ga
                # note is nay Nan ko siray say mean nikalnay k liye use hi ni kia
                # it means by default skipna = True hta hay
                # (1.4 + 7.1 + 0.75)/3 = 3.08333

print()
print(df.mean(axis = 'columns', skipna = False)) # jis row main aik bar bhi Nan aaya tha, vo pori row hi Nan ho gai! 
                                                 # cuz of 'skipna' = False
                                                 # is nay (1.4 + Nan)/2 = Nan kia

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

one    3.083333
two   -2.900000
dtype: float64

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [68]:
print(df.mean(axis = 'columns', skipna = True)) # ab is nay jahan jahan Nan aaya, vo pori value skip kr di
                                                # 1.4/2 nahi kia, bal kay, 1.4/1 kia

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

### Unique Values
#### .unique()

Aik value agar aik say ziada baar aai hui hay kisi column main , tu ye osay aik bar hi print kray ga, ak bar say ziada bar osay
Show nahi krvaye ga

In [14]:
import numpy as np
import pandas as pd


df = pd.DataFrame([
                    [1.4, 1.4,    1.5, np.nan],    [7.1,  -4.5, 1.5, 1.4],
                    [1.4, np.nan, 0.5, np.nan],    [0.75, -1.3, 1.3, np.nan]
                   ],
                    index = ['a', 'b', 'c', 'd'], columns = ['one', 'two', 'three', 'four'] )

print(df)
print()

print( df['one'].unique(), df['two'].unique() )

# Amazing! ye saray counts bta raha hay k, kon kon si value kitni kitni bar aai, kisi column main
# Note:
#     isay pori table par apply nai kr sktay, column wise hi apply kr sktay hain

df['one'].value_counts()

    one  two  three  four
a  1.40  1.4    1.5   NaN
b  7.10 -4.5    1.5   1.4
c  1.40  NaN    0.5   NaN
d  0.75 -1.3    1.3   NaN

[1.4  7.1  0.75] [ 1.4 -4.5  nan -1.3]

one
1.40    2
7.10    1
0.75    1
Name: count, dtype: int64

# Indexing and Slicing in DataFrames

In [18]:
import numpy as np
import pandas as pd

data_df = pd.DataFrame(np.arange(16).reshape((4,4)),
                      index   = ['Ohio', 'Colorado', 'Utah', 'New York'],
                      columns = ['one', 'two', 'three', 'four']
                      )
print(data_df, '\n')

# in the loc method specify row label
# then specify column names
# remember! multiple column names require array notation

print('One row - with 2 columns selected \n',data_df.loc['Colorado', ['two', 'three'] ] )            # Colorado vli row main ['two' , 'three'] columns vli values return keen
print()
print('Two rows - with 2 columns selected \n', data_df.loc[ ['Colorado', 'Ohio'], ['two', 'three'] ] ) # multiple rows, multiple columns

print('\n\n')
print( data_df.iloc[2, [3, 0, 1] ] )  # same-to-same .loc[] vala kaam hi hay, but yahan hum numbers day sktay hain


print('\n\n All rows')
print(data_df.iloc[:] )         # voi numpy vli fancy indexing vala scene hay

print('\n\n All rows but 0,1,2 columns')
print(data_df.iloc[:, :3 ] )    # yahan tu exactly fancy indexing vala scene hay

print('\n\n ')
print(data_df.iloc[:2,] )       # exactly voi fancy indexing vala chakkar hay# [data_df.three > 5]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

One row - with 2 columns selected
 two      5
three    6
Name: Colorado, dtype: int32

Two rows - with 2 columns selected
           two  three
Colorado    5      6
Ohio        1      2



four    11
one      8
two      9
Name: Utah, dtype: int32


 All rows
          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15


 All rows but 0,1,2 columns
          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14



          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

# Arithmetic & Data Alignment

In [19]:
df1 = pd.DataFrame(np.arange(9).reshape((3,3)),
                  columns = list('bcd'),
                  index = ['Ohio', 'Texas', 'Colorado'])

df2 = pd.DataFrame(np.arange(12).reshape((4,3)),
                  columns = list('bde'),
                  index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

print(df1)
print()
print(df2)
print()

# Applying plus operation b/w two data frames

df3 = df1 + df2

print(df3)

# Rows ka union bhi aaya
# Columns ka union bhi aaya
#                             # + Nan = Nan

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

# Arithmetic Method with Fill Values

#### Filling Nan Values

In [20]:
# creating data frames without any Nan values

import pandas as pd
import numpy as np


df1 = pd.DataFrame(np.arange(12).reshape((3,4)),
                   columns = list('abcd'))

df2 = pd.DataFrame(np.arange(20).reshape((4,5)),
                   columns = list('abcde'))

print(df1)
print()
print(df2)

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [21]:
# putting Nan at a specific entry

df2.loc[1, 'b'] = np.nan

print(df2)

    a     b   c   d   e
0   0   1.0   2   3   4
1   5   NaN   7   8   9
2  10  11.0  12  13  14
3  15  16.0  17  18  19

In [4]:
#  Direct Doing Summation without fill_value
df3 = df1 + df2
df3
# daikha  ' any_# + Nan = Nan '

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [5]:
# Summation with fill_value

df3 = df1.add(df2, fill_value = 0)
print(df3)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

#### similarly hum multiply main bhi yei kaam kar sktay hain.

See Book for more details

## Operations b/w DataFrame & Series

In [1]:
import numpy as np
import pandas as pd

frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                    columns = list('bde'),
                    index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [2]:
# iloc syntax
# iloc[start_row_pos : end_row_pos, start_column_pos : end_column_pos]
series = frame.iloc[0]

print(series)
print()

print(series.values)
print()

print(series.index)
print()

b    0
d    1
e    2
Name: Utah, dtype: int32

[0 1 2]

Index(['b', 'd', 'e'], dtype='object')

In [8]:
frame - series

# frame - series

#   0 - 0=0     1 - 1=0   2 - 2=0
#   3 - 0=3     4 - 1=3   5 - 2=3
#   6 - 0=6     7 - 1=6   8 - 2=6
#     .         .       .

# Series aik row ki trah behave kray gi, series-row ki har aik aik entry
# DataFrame-rows ki corresponding entries '-' hoon gi

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

## Filling Missing Values in Columns

In [3]:
# Creating a DataFrame
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}


state_popu_df = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'])
print(state_popu_df)


# Filling the Missing Values
a = len(state_popu_df['debt'])

state_popu_df['debt'] = np.arange( a )

print('\n\n', state_popu_df)

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN


    year   state  pop  debt
0  2000    Ohio  1.5     0
1  2001    Ohio  1.7     1
2  2002    Ohio  3.6     2
3  2001  Nevada  2.4     3
4  2002  Nevada  2.9     4
5  2003  Nevada  3.2     5

In [24]:
# similarly 'Indexing and Slicing in DataFrames' section main aap daikh sktay ho k d/f arrangements ko kesay select krna hay


state_popu_df.loc[ [0, 1], ['pop','debt'] ] = np.arange(4).reshape((2,2))

print(state_popu_df.loc[ [0, 1], ['pop','debt'] ])

   pop  debt
0  0.0     1
1  2.0     3

In [25]:
# Another Possibility - Filling with a single value

state_popu_df.loc[ [0, 1], ['pop','debt'] ] = 0

print(state_popu_df.loc[ [0, 1], ['pop','debt'] ])

   pop  debt
0  0.0     0
1  0.0     0

In [36]:
# Filling with a Series

# Series k index and DataFrame k index aapas main match honay chahiyain

val = pd.Series( [1, 2, 3, 4, 5, 6], index = [5, 0, 1, 2, 3, 4] )

state_popu_df['debt'] = val

print(state_popu_df)

# series k 5th index pr 1 pra hua tha, ye automatically 1 ko DataFrame ki corresponding
# 5th index pr lay gaya

   year   state  pop  debt
0  2000    Ohio  0.0     2
1  2001    Ohio  0.0     3
2  2002    Ohio  3.6     4
3  2001  Nevada  2.4     5
4  2002  Nevada  2.9     6
5  2003  Nevada  3.2     1

#### index length must be equal to length of values, otherwise do not provide indices

### Dropping Data

In [42]:
import numpy as np
import pandas as pd

data_df = pd.DataFrame(np.arange(16).reshape((4,4)),
                      index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                      columns = ['one', 'two', 'three', 'four'])

# dataframe.drop method would return a new-dataframe, the old-dataframe will remain
# unchanged, but the new-dataframe will have the specified rows/columns deleted

data_2_df = data_df.drop('two', axis = 1) # can also use axis = 'columns'

print('Original Data: \n', data_df)
print('\n\n')

print('Data without column (two): \n', data_2_df)

Original Data:
           one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15



Data without column (two):
           one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [44]:
data_2_df = data_df.drop('Ohio', axis = 0) # can also use axis = 'rows'

print('Original Data: \n', data_df)
print('\n\n')

print('Data without row (Ohio): \n', data_2_df)

Original Data:
           one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15



Data without row (Ohio):
           one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [46]:
# If you don't want to crete a new-dataframe but instead want to use the old-dataframe,
# use:

# data_df = data_df.drop('Ohio', axis = 0)
# print('Updated dataframe is: \n', data_df)

# Or use:
data_df.drop('Ohio', axis = 0, inplace = True) #Note: inplace = True

print('Updated dataframe is: \n', data_df)

Updated dataframe is:
           one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## Indexing, Selection & Filtering

ye kitaab ka hi aik topic hay

In [62]:
import numpy as np
import pandas as pd

data_df = pd.DataFrame(np.arange(16).reshape((4,4)),
                      index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                      columns = ['One', 'Two', 'Three', 'Four'])

print('The origina data is: \n', data_df)

print('\n\ndata_df[ [one, three] ] gives: \n ',  data_df[ ["One", "Three"] ] )

# can use numpy style as well

print('\n\ndata_df[2:] gives: \n ',  data_df[2: ] ) # pehli 2 rows, tamaam columns

The origina data is:
           One  Two  Three  Four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15


data_df[ [one, three] ] gives:
            One  Three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14


data_df[2:] gives:
            One  Two  Three  Four
Utah        8    9     10    11
New York   12   13     14    15

See book for further details

In [63]:
# Mind Teaser !!

# Assigning a column that already exists will ________ and
# assigning a column that does'nt already exists will _________.

## Reindexing & use of 'ffill' value of parameter = 'method'

In [77]:
import pandas as pd

obj3 = pd.Series(['blue', 'purple', 'yellow'],
                index = [0, 3, 6])
print(obj3)


# hum indices/rows barha rahay hain

obj3 = obj3.reindex(range(9))
print('\n\nWithout ffill we get:')
print(obj3)



obj3 = pd.Series(['blue', 'purple', 'yellow'],
                index = [0, 3, 6])
obj3 = obj3.reindex(range(9), method = 'ffill')
print('\n\nWith ffill we get:')
print(obj3)

0      blue
3    purple
6    yellow
dtype: object


Without ffill we get:
0      blue
1       NaN
2       NaN
3    purple
4       NaN
5       NaN
6    yellow
7       NaN
8       NaN
dtype: object


With ffill we get:
0      blue
1      blue
2      blue
3    purple
4    purple
5    purple
6    yellow
7    yellow
8    yellow
dtype: object

In [84]:
obj3 = pd.Series(['blue', 'purple', 'yellow'],
                index = [0, 3, 6])
print(obj3)

obj3 = obj3.reindex(range(3,6))
print('\n\nWithout ffill we get:')
print(obj3)

# index-3 original series main mojood tha, os k corresponding aik value mojood thi,
# so, reindexing mn os k corresponding voi value aa gai
# index-4 & index-5 original series main mojood nahi thay, so after reidexing,
# in k corresponding 'Nan' aaya

obj3 = pd.Series(['blue', 'purple', 'yellow'],
                index = [0, 3, 6])

obj3 = obj3.reindex(range(2,11), method = 'ffill')
print('\n\nWith ffill we get:')
print(obj3)

# hua ye k index-2 par ffill ki vja say index-0 vali value aa gai
# index-3 par originally purple tha, so index-3 say onward purple hi aaya
# index-6 par originally yellow tha, so yahan say onward, jb tak index khatam
# nahi hua, yellow hi continue hua

0      blue
3    purple
6    yellow
dtype: object


Without ffill we get:
3    purple
4       NaN
5       NaN
dtype: object


With ffill we get:
2       blue
3     purple
4     purple
5     purple
6     yellow
7     yellow
8     yellow
9     yellow
10    yellow
dtype: object

# Live Recordings

sir Nasir k data main Learning pandas by Michael Heydt vli book bhi pri hui hay, vo book bhi achi hay

# Pandas
- Data Analysis Library
- Two Structures in Pamdas
    - Series:    Single Dimensional
    - Dataframe: Multidimensional

# For Series See studio recording session

# Data Frames

In [ ]:
### Different ways to create a DataFrame

In [42]:
#### Using Dictionaries

In [48]:
students = {
    'rolls'  : [1,2,3,4,5,6],
    'names'  : ['Ali', 'Amjad', 'Saima', 'Qaiser', 'Hamid', 'Nasir'],
    'courses': ['Python', 'Pandas', 'Numpy', 'Pandas', 'Numpy'],            # tmaam columns k no. of indices equal hnay chahiyain jab ap Data Frame bna rahay ho tb
    'mode'   : ['Online', 'Onsite', 'Online', 'Onsite', 'Online', 'Onsite']
            }

In [49]:
# eror expected
df = pd.DataFrame( students )

ValueError: All arrays must be of the same length

In [51]:
students = {
    'rolls'  : [1,2,3,4,5,6],
    'names'  : ['Ali', 'Amjad', 'Saima', 'Qaiser', 'Hamid', 'Nasir'],
    'courses': ['Python', 'Pandas', 'Numpy', 'Pandas', 'Numpy', 'Python'],
    'mode'   : ['Online', 'Onsite', 'Online', 'Onsite', 'Online', 'Onsite']
            }

In [52]:
df = pd.DataFrame( students )
df

   rolls   names courses    mode
0      1     Ali  Python  Online
1      2   Amjad  Pandas  Onsite
2      3   Saima   Numpy  Online
3      4  Qaiser  Pandas  Onsite
4      5   Hamid   Numpy  Online
5      6   Nasir  Python  Onsite

In [54]:
type( df[ 'rolls' ] )

pandas.core.series.Series

In [55]:
type( df[ ['rolls'] ] )

pandas.core.frame.DataFrame

In [56]:
type( df[ ['rolls', 'names'] ] )

pandas.core.frame.DataFrame

In [58]:
a = np.array(9)

In [59]:
type( a )

numpy.ndarray

In [61]:
a.ndim

0

In [74]:
a = np.array([9])

In [75]:
type( a )

numpy.ndarray

In [76]:
a.ndim

1

In [77]:
a = np.array([[9]])

In [78]:
type( a )

numpy.ndarray

In [79]:
a.ndim

2

In [80]:
### Using Lists

In [92]:
# using 1d list and broadcasting(automatic)
lst = [55, 66, 77]

In [93]:
a = pd.DataFrame( [lst], index = [1,2,3], columns = ['a', 'b', 'c'] )   # note ''[]'' around 'lst'

print( a )

    a   b   c
1  55  66  77
2  55  66  77
3  55  66  77

In [96]:
# using 2d list

lst = [ [55, 66, 77], [2,4,5], [4,5,6] ]

# yani is trah ki list-of-lists aik 2d list hti hay

In [97]:
a = pd.DataFrame( lst, index = [1,2,3], columns = ['a', 'b', 'c'] )

print( a )

    a   b   c
1  55  66  77
2   2   4   5
3   4   5   6

## Accessing the Data

In [171]:
import pandas as pd
import numpy  as np


students = {
    'rolls'  : [1,2,3,4,5,6],
    'names'  : ['Ali', 'Amjad', 'Saima', 'Qaiser', 'Hamid', 'Nasir'],
    'courses': ['Python', 'Pandas', 'Numpy', 'Pandas', 'Numpy', 'Python'],
    'mode'   : ['Online', 'Onsite', 'Online', 'Onsite', 'Online', 'Onsite']
            }


df = pd.DataFrame( students )

df

   rolls   names courses    mode
0      1     Ali  Python  Online
1      2   Amjad  Pandas  Onsite
2      3   Saima   Numpy  Online
3      4  Qaiser  Pandas  Onsite
4      5   Hamid   Numpy  Online
5      6   Nasir  Python  Onsite

### Acessing columns

In [108]:


df['courses']

0    Python
1    Pandas
2     Numpy
3    Pandas
4     Numpy
5    Python
Name: courses, dtype: object

In [114]:
df['courses'][::2]

0    Python
2     Numpy
4     Numpy
Name: courses, dtype: object

In [117]:
# multiple columns
df[ ['courses', 'names'] ][:]

  courses   names
0  Python     Ali
1  Pandas   Amjad
2   Numpy   Saima
3  Pandas  Qaiser
4   Numpy   Hamid
5  Python   Nasir

In [ ]:
# modifying data

In [172]:
df['courses'] = 'Python'
df

   rolls   names courses    mode
0      1     Ali  Python  Online
1      2   Amjad  Python  Onsite
2      3   Saima  Python  Online
3      4  Qaiser  Python  Onsite
4      5   Hamid  Python  Online
5      6   Nasir  Python  Onsite

In [173]:
# adding a new column
df['Country'] = 'Pakistan'
df

   rolls   names courses    mode   Country
0      1     Ali  Python  Online  Pakistan
1      2   Amjad  Python  Onsite  Pakistan
2      3   Saima  Python  Online  Pakistan
3      4  Qaiser  Python  Onsite  Pakistan
4      5   Hamid  Python  Online  Pakistan
5      6   Nasir  Python  Onsite  Pakistan

In [122]:
df['Country'] = np.nan
df

   rolls   names courses    mode  Country
0      1     Ali  Python  Online      NaN
1      2   Amjad  Pandas  Onsite      NaN
2      3   Saima   Numpy  Online      NaN
3      4  Qaiser  Pandas  Onsite      NaN
4      5   Hamid   Numpy  Online      NaN
5      6   Nasir  Python  Onsite      NaN

In [123]:
df['Country'][1:4] = 'Pakistan'
df

C:\Users\Ans Imran\AppData\Local\Temp\ipykernel_3184\2714327960.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Country'][1:4] = 'Pakistan'

   rolls   names courses    mode   Country
0      1     Ali  Python  Online       NaN
1      2   Amjad  Pandas  Onsite  Pakistan
2      3   Saima   Numpy  Online  Pakistan
3      4  Qaiser  Pandas  Onsite  Pakistan
4      5   Hamid   Numpy  Online       NaN
5      6   Nasir  Python  Onsite       NaN

In [126]:
df['Country'] = 'Pakistan'
df

   rolls   names courses    mode   Country
0      1     Ali  Python  Online  Pakistan
1      2   Amjad  Pandas  Onsite  Pakistan
2      3   Saima   Numpy  Online  Pakistan
3      4  Qaiser  Pandas  Onsite  Pakistan
4      5   Hamid   Numpy  Online  Pakistan
5      6   Nasir  Python  Onsite  Pakistan

In [174]:
df['Ages'] = [23, 34, 23, 21, 20, 19]
df

   rolls   names courses    mode   Country  Ages
0      1     Ali  Python  Online  Pakistan    23
1      2   Amjad  Python  Onsite  Pakistan    34
2      3   Saima  Python  Online  Pakistan    23
3      4  Qaiser  Python  Onsite  Pakistan    21
4      5   Hamid  Python  Online  Pakistan    20
5      6   Nasir  Python  Onsite  Pakistan    19

In [175]:
dic = {
    'Ali'   : 34,
    'Amjad' : 45,
    'Saima' : 23,
    'Qaiser': 45,
    'Nasir' : 20,
    'Hamid' : 34
    }

# Note ages df valay order main nahi hain

# hum chahtay hain k ages df main add krain, but vo automatically corresponding names ko ja k assign ho jayain
# humain ab mapping use krni pray gi, abhi professor is task ko hold kr rahay hain, baad main krvayain gay

In [178]:
df['newAges'] = df.names.map(dic)
df
# kia baat hay 'name' k opar map kr dia

   rolls   names courses    mode   Country  Ages  newAges
0      1     Ali  Python  Online  Pakistan    23       34
1      2   Amjad  Python  Onsite  Pakistan    34       45
2      3   Saima  Python  Online  Pakistan    23       23
3      4  Qaiser  Python  Onsite  Pakistan    21       45
4      5   Hamid  Python  Online  Pakistan    20       34
5      6   Nasir  Python  Onsite  Pakistan    19       20

In [137]:
# condition-based data addition
# list comprehension 

df[ 'Status' ] = [ 'Pass' if i > 25 else 'Fail' for i in df['Ages'] ] # isay list comprehension kehtay hain
df

   rolls   names courses    mode   Country  Ages Status
0      1     Ali  Python  Online  Pakistan    23   Fail
1      2   Amjad  Pandas  Onsite  Pakistan    34   Pass
2      3   Saima   Numpy  Online  Pakistan    23   Fail
3      4  Qaiser  Pandas  Onsite  Pakistan    21   Fail
4      5   Hamid   Numpy  Online  Pakistan    20   Fail
5      6   Nasir  Python  Onsite  Pakistan    19   Fail

In [142]:
# using lambda function

df[ 'City' ] = df['mode'].apply(lambda x: 'Karachi' if x == 'Onsite' else 'OutofKhi')
df

   rolls   names courses    mode   Country  Ages Status      City
0      1     Ali  Python  Online  Pakistan    23   Fail  OutofKhi
1      2   Amjad  Pandas  Onsite  Pakistan    34   Pass   Karachi
2      3   Saima   Numpy  Online  Pakistan    23   Fail  OutofKhi
3      4  Qaiser  Pandas  Onsite  Pakistan    21   Fail   Karachi
4      5   Hamid   Numpy  Online  Pakistan    20   Fail  OutofKhi
5      6   Nasir  Python  Onsite  Pakistan    19   Fail   Karachi

In [143]:
# using np.where in lambda

df[ 'City' ] = df['mode'].apply(lambda x: np.where(x == 'Online', 'Karachi', 'OutofKhi'))
df

   rolls   names courses    mode   Country  Ages Status      City
0      1     Ali  Python  Online  Pakistan    23   Fail   Karachi
1      2   Amjad  Pandas  Onsite  Pakistan    34   Pass  OutofKhi
2      3   Saima   Numpy  Online  Pakistan    23   Fail   Karachi
3      4  Qaiser  Pandas  Onsite  Pakistan    21   Fail  OutofKhi
4      5   Hamid   Numpy  Online  Pakistan    20   Fail   Karachi
5      6   Nasir  Python  Onsite  Pakistan    19   Fail  OutofKhi

In [152]:
# traditional way
def generationAssign(age):
    if age < 20:
        return 'Teen Ager'
    elif age < 40:
        return 'Young'
    elif age < 60:
        return 'Matured'
    else:
        return 'Seniors'

In [154]:
df[ 'Generation' ] = df['Ages'].apply( generationAssign ) # Note hum nay 'generationAssign()' nahi likha bal k 'generationAssign' likha
df

   rolls   names courses    mode   Country  Ages Status      City Generation
0      1     Ali  Python  Online  Pakistan    23   Fail   Karachi      Young
1      2   Amjad  Pandas  Onsite  Pakistan    34   Pass  OutofKhi      Young
2      3   Saima   Numpy  Online  Pakistan    23   Fail   Karachi      Young
3      4  Qaiser  Pandas  Onsite  Pakistan    21   Fail  OutofKhi      Young
4      5   Hamid   Numpy  Online  Pakistan    20   Fail   Karachi      Young
5      6   Nasir  Python  Onsite  Pakistan    19   Fail  OutofKhi  Teen Ager

In [170]:
# exporting data as xlsx file 

df.to_excel("students.xlsx")

# sir ka tu ye chal rha tha, pta ni mera q nahi chl raha

ModuleNotFoundError: No module named 'openpyxl'

In [ ]:
# Data Loading

In [179]:
data = pd.read_csv('astronauts.csv')

# wite 'pd.read' press 'Tab' u'll see all the formats from which we can read the data
# pd.read

In [180]:
data

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,5/17/1967,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaN,NaN
1,Loren W. Acton,NaN,NaN,Retired,3/7/1936,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaN,NaN
2,James C. Adamson,1984.0,10.0,Retired,3/3/1946,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaN,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,5/20/1951,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaN,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1/20/1930,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
352,David A. Wolf,1990.0,13.0,Retired,8/23/1956,"Indianapolis, IN",Male,Purdue University; Indiana University,Electrical Engineering,Medicine,NaN,NaN,3,4044,7,41.0,STS-58 (Columbia). STS-86/89 (Atlantis/Endeavo...,NaN,NaN
353,Neil W. Woodward III,1998.0,17.0,Retired,7/26/1962,"Chicago, IL",Male,MIT; University of Texas-Austin; George Washin...,Physics,Physics; Business Management,Commander,US Navy,0,0,0,0.0,NaN,NaN,NaN
354,Alfred M. Worden,1966.0,5.0,Retired,2/7/1932,"Jackson, MI",Male,US Military Academy; University of Michigan,Military Science,Aeronautical & Astronautical Engineering,Colonel,US Air Force (Retired),1,295,1,0.5,Apollo 15,NaN,NaN
355,John W. Young,1962.0,2.0,Retired,9/24/1930,"San Francisco, CA",Male,Georgia Institute of Technology,Aeronautical Engineering,NaN,Captain,US Navy (Retired),6,835,3,20.0,"Gemini 3, Gemini 10, Apollo 10, Apollo 16, STS...",NaN,NaN
356,George D. Zamka,1998.0,17.0,Retired,6/29/1962,"Jersey City, NJ",Male,US Naval Academy; Florida Institute of Technology,Mathematics,Engineering Management,Colonel,US Marine Corps (Retired),2,692,0,0.0,"STS-120 (Discovery), STS-130 (Endeavor)",NaN,NaN

# Live Recording 28 Jan

In [183]:
# Data Loading

In [184]:
data = pd.read_csv('astronauts.csv')

# wite 'pd.read' press 'Tab' u'll see all the formats from which we can read the data
# pd.read

In [185]:
data.shape

(357, 19)

In [ ]:
# => 2d data and choota sa data

In [186]:
data.ndim

2

In [188]:
data.head(1)

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,5/17/1967,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaN,NaN

In [192]:
data.tail(3) # last three records

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
354,Alfred M. Worden,1966.0,5.0,Retired,2/7/1932,"Jackson, MI",Male,US Military Academy; University of Michigan,Military Science,Aeronautical & Astronautical Engineering,Colonel,US Air Force (Retired),1,295,1,0.5,Apollo 15,NaN,NaN
355,John W. Young,1962.0,2.0,Retired,9/24/1930,"San Francisco, CA",Male,Georgia Institute of Technology,Aeronautical Engineering,NaN,Captain,US Navy (Retired),6,835,3,20.0,"Gemini 3, Gemini 10, Apollo 10, Apollo 16, STS...",NaN,NaN
356,George D. Zamka,1998.0,17.0,Retired,6/29/1962,"Jersey City, NJ",Male,US Naval Academy; Florida Institute of Technology,Mathematics,Engineering Management,Colonel,US Marine Corps (Retired),2,692,0,0.0,"STS-120 (Discovery), STS-130 (Endeavor)",NaN,NaN

In [193]:
data.sample(10) # 10 random records

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
265,Mark L. Polansky,1996.0,16.0,Retired,6/2/1956,"Paterson, NJ",Male,Purdue University,Aeronautical & Astronautical Engineering,Aeronautical & Astronautical Engineering,NaN,NaN,3,995,0,0.0,"STS-98 (Atlantis), ST-116 (Discovery), STS-127...",NaN,NaN
41,Curtis L. Brown Jr.,1987.0,12.0,Retired,3/11/1956,"Elizabethtown, NC",Male,US Air Force Academy,Electrical Engineering,NaN,Colonel,US Air Force (Retired),6,1383,0,0.0,"STS-47 (Endeavor), STS-66 (Atlantis), STS-77 (...",NaN,NaN
9,Clayton C. Anderson,1998.0,17.0,Retired,2/23/1959,"Omaha, NE",Male,Hastings College; Iowa State University,Physics,Aerospace Engineering,NaN,NaN,2,4005,6,38.0,"STS-117/120 (Atlantis/Discovery), STS-131 (Dis...",NaN,NaN
36,Charles E. Brady Jr.,1992.0,14.0,Deceased,8/12/1951,"Pinehurst, NC",Male,University of North Carolina at Chapel Hill; D...,NaN,Medicine,Captain,US Navy,1,405,0,0.0,STS-78 (Columbia),7/23/2006,NaN
65,Franklin R. Chang-Diaz,1980.0,9.0,Retired,4/5/1950,"San Jose, Costa Rica",Male,University of Connecticut; MIT,Mechanical Engineering,Applied Plasma Physics,NaN,NaN,7,1602,3,19.0,"STS 61-C (Columbia), STS-34 (Atlantis), STS-46...",NaN,NaN
350,G. Reid Wiseman,2009.0,20.0,Active,11/11/1975,"Baltimore, MD",Male,Rensselaer Polytechnic Institute; Johns Hopkin...,Computer & Systems Engineering,Systems Engineering,Commander,US Navy,1,3968,2,13.0,ISS-40/41 (Soyuz),NaN,NaN
124,Owen K. Garriott,1965.0,4.0,Retired,11/22/1930,"Enid, OK",Male,University of Oklahoma; Stanford University,Electrical Engineering,Electrical Engineering,NaN,NaN,2,1674,3,14.0,"Skylab 3, STS-9 (Columbia)",NaN,NaN
56,M. Scott Carpenter,1959.0,1.0,Retired,5/1/1925,"Boulder, CO",Male,University of Colorado,Aeronautical Engineering,NaN,Commander,US Navy (Retired),1,4,0,0.0,Mercury 7,NaN,NaN
286,Russell L. Schweickart,1963.0,3.0,Retired,10/25/1935,"Neptune, NJ",Male,MIT,Aeronautics & Astronautics,Aeronautics & Astronautics,NaN,NaN,1,241,1,1.0,Apollo 9,NaN,NaN
274,Sally K. Ride,1978.0,8.0,Deceased,5/26/1951,"Los Angeles, CA",Female,Stanford University,Physics; English,Physics,NaN,NaN,2,343,0,0.0,"STS-7 (Challenger), STS 41-G (Challenger)",7/23/2012,NaN

In [195]:
data.columns

Index(['Name', 'Year', 'Group', 'Status', 'Birth Date', 'Birth Place',
       'Gender', 'Alma Mater', 'Undergraduate Major', 'Graduate Major',
       'Military Rank', 'Military Branch', 'Space Flights',
       'Space Flight (hr)', 'Space Walks', 'Space Walks (hr)', 'Missions',
       'Death Date', 'Death Mission'],
      dtype='object')

In [196]:
# changing column names

data.columns = [11,22,33,44,55,66,77,88,99,100,111,222,333,444,555,666,777,888,999]

In [197]:
data.columns

Int64Index([ 11,  22,  33,  44,  55,  66,  77,  88,  99, 100, 111, 222, 333,
            444, 555, 666, 777, 888, 999],
           dtype='int64')

In [200]:
# changing the name of specific column, e.g: 'Military Rank'

data.columns = ['Name', 'Year', 'Group', 'Status', 'Birth Date', 'Birth Place',
       'Gender', 'Alma Mater', 'Undergraduate Major', 'Graduate Major',
       5, 'Military Branch', 'Space Flights',
       'Space Flight (hr)', 'Space Walks', 'Space Walks (hr)', 'Missions',
       'Death Date', 'Death Mission']

In [201]:
data.columns

Index([               'Name',                'Year',               'Group',
                    'Status',          'Birth Date',         'Birth Place',
                    'Gender',          'Alma Mater', 'Undergraduate Major',
            'Graduate Major',                     5,     'Military Branch',
             'Space Flights',   'Space Flight (hr)',         'Space Walks',
          'Space Walks (hr)',            'Missions',          'Death Date',
             'Death Mission'],
      dtype='object')

In [ ]:
# another way
data.rename( columns = [] )

In [203]:
# Resetting

data.columns = ['Name', 'Year', 'Group', 'Status', 'Birth Date', 'Birth Place',
       'Gender', 'Alma Mater', 'Undergraduate Major', 'Graduate Major',
       'Military Rank', 'Military Branch', 'Space Flights',
       'Space Flight (hr)', 'Space Walks', 'Space Walks (hr)', 'Missions',
       'Death Date', 'Death Mission']

In [205]:
# removing spaces from the names of the columns

data.rename( columns = {
    'Birth Date' : 'birth_date',
    'Birth Place': 'birth_place',
    'Alma Mater':'alma_mater', 'Undergraduate Major': 'undergraduate_major', 'Graduate Major': 'graduate_major',
       'Military Rank': 'military_rank', 'Military Branch': 'military_branch', 'Space Flights': 'space_flights',
       'Space Flight (hr)': 'space_flight_(hr)', 'Space Walks': 'space_walks', 'Space Walks (hr)': 'space_walks_(hr)',
       'Death Date': 'death_date', 'Death Mission': 'death_mission'
    } )

# Note: 'Missions': ye valay column ka naam hum chnage ni krna chhtay thay, so hum nay opar vli dictionary main isay likha hi nahi

data.head(1)

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,5/17/1967,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaN,NaN